{
    "ツール使用の制限について": "Tools Usage Restrictions",
    "平素よりOMCに参加していただきありがとうございます．": "Thank you for participating in OMC.",
    "OMCでは参加がrated/unratedに関わらず，コンテスト時間内のプログラミング・生成AIをはじめとしたアナログでないツールの使用は禁じられています．詳しくは「<a href=\"https://onlinemathcontest.com/rules\">RULES &gt; ルール</a>」を参照ください．ここに示されたルールの違反行為と思われる不審な挙動を示したユーザーを運営が確認した場合，運営内部での審議の上で一時的または永久に該当アカウントをBANする場合があります．": "At OMC, the use of non-analog tools—such as programming or generative AI—is prohibited during the contest period, regardless of whether the contest is rated or unrated. For more details, please refer to \"<a href=\\\"https://onlinemathcontest.com/rules\\\">RULES &gt; Rules</a>\". If the organizers detect suspicious behavior that appears to violate these rules, the account in question may be temporarily or permanently banned following internal review.",

    "OMCB035はunratedとなります": "OMCB035 will be marked as unrated.",
    "先ほど開催されましたOMCB035のH問題に関して，検証を行った結果，問題文の条件を全て満たす図が存在しないことがコンテスト中に発覚しました．これに伴い，<strong>当コンテストをunratedとさせていただきます</strong>．皆様の貴重な時間を奪う結果となってしまったことを深くお詫び申し上げます．": "Regarding Problem H of OMCB035, which was held earlier, our verification during the contest revealed that there exists no figure satisfying all the conditions stated in the problem. <strong>As a result, we will mark this contest as unrated.</strong> We sincerely apologize for having wasted your valuable time.",
    "現在，OMCB035H問題は正しく解ける状態ではないため，可及的速やかに数値・設定を変更して正しく解ける状態にする所存です．<strong>2025/2/16 追記：現在追加されている修正版の問題は正しく解ける状態になっています．</strong>": "Currently, Problem H of OMCB035 cannot be solved correctly as it stands. We intend to promptly revise the values and settings to make it solvable. <strong>Update on 2025/2/16: The revised version of the problem has now been updated and is solvable.</strong>",
    "図の存在性の未確認という作問における初歩的なミスをしてしまったことは非常に悔やまれることであり，問題の不備自体があってはならないことだと認識しています．この度は信頼を損ねる結果となってしまい誠に申し訳ありませんでした．より一層再発防止に努めて参りますので，引き続きOMCをどうかよろしくお願い申し上げます．": "We deeply regret the fundamental error of failing to verify the existence of a valid figure in the problem creation process. We recognize that such flaws in problems should never occur. We sincerely apologize for undermining your trust. We will make every effort to prevent such issues from recurring, and we ask for your continued support of OMC.",

    "雑誌「現代数学」の2025年2月号に記事が掲載されました": "An article was published in the February 2025 issue of the magazine *Gendai Sugaku*.",
    "雑誌「現代数学」の2025年2月号に，先日開催されたOnline Math Contest：Proxima Technology杯についての記事が掲載されました！": "An article about the recently held Online Math Contest: Proxima Technology Cup has been published in the February 2025 issue of the magazine *Gendai Sugaku*!",
    "本コンテストはPlatinum Sponsorである株式会社 Proxima Technology様との共催です．": "This contest was co-hosted with our Platinum Sponsor, Proxima Technology Inc.",
    "記事はSilver Sponsorであるお茶ゼミ√＋の吉田信夫先生にご執筆いただきました．": "The article was written by Mr. Nobuo Yoshida of Ocha Seminar √＋, our Silver Sponsor."  
  } 