{
    "ルール": "Rules",
    "アカウントについて": "About Accounts",
    "同一人物が複数のアカウントを所持する行為や，複数人で同一のアカウントを所持する行為は，固く禁止されております．ただし，一部の例外がございます．": "It is strictly prohibited for a single person to possess multiple accounts or for multiple people to share the same account. However, there are some exceptions.",
    "コンテストでの不正行為が確認されたアカウント，または不正行為が疑われる不審な挙動を示したアカウントについては，同意なくコンテストの成績を無効とするか，またはアカウントの利用を停止することがあります．": "If an account is found to have engaged in misconduct during a contest, or shows suspicious behavior suggesting misconduct, its contest results may be invalidated or the account may be suspended without prior notice.",
    "新規登録方法": "How to Register",
    "OnlineMathContest（以下，OMC）にはどなたでもご登録いただけます．": "Anyone can register for OnlineMathContest (hereafter, OMC).",
    "トップページ右上の「LOGIN」を押し，「新規登録」を選択します．": "Click 'LOGIN' at the top right of the homepage and select 'Register'.",
    "各情報を入力します．": "Enter the required information.",
    "「Username」がOMCにおけるユーザー（以下，solver）の固有名となります．一度設定しますと変更不可能ですので，ご注意ください．": "The 'Username' will serve as your unique identifier (solver) on OMC. Please note that once set, it cannot be changed.",
    "登録後，入力されたメールアドレスに認証用メールが届きます．メールアドレスが認証されるまでコンテストには参加できませんのでご注意ください．": "After registration, a verification email will be sent to your email address. You will not be able to participate in contests until your email address is verified.",
    "解答の提出方法": "How to Submit Answers",
    "解答すべき値は必ず一つの非負整数値となることが保証されております．": "It is guaranteed that the answer to be submitted will always be a single non-negative integer.",
    "最終的に解答すべき値のみを半角で入力してください．途中経過は要求しません．単位なども付さないでください．": "Please enter only the final value to be submitted using half-width characters. Intermediate steps are not required, and do not include any units.",
    "正答は「CA」と表現され，緑色で表されます．誤答は「WA」と表現され，赤色で表されます．": "Correct answers are marked as 'CA' and displayed in green. Incorrect answers are marked as 'WA' and displayed in red.",
    "過去のコンテストの問題についても，すべて常に提出が可能な状態となっております．": "All problems from past contests are always available for answer submission.",
    "コンテストのルール": "Contest Rules",
    "基本的にどなたでもすべてのコンテストにご参加いただけます．": "Basically, anyone may participate in all contests.",
    "解答はすべて一人で行ってください．複数人で結託する行為は，固く禁止されております．": "All solutions must be your own. Collusion with others is strictly prohibited.",
    "それぞれのsolverがコンテスト中に一つの問題に行える提出は，10回までとなっております．したがって，最終的に正答するために許容される誤答は9回までであることにご注意ください．": "Each solver may submit up to 10 answers per problem during a contest. Therefore, you are allowed up to 9 incorrect attempts per problem before giving the correct answer.",
    "順位の決定法について": "About Ranking Determination",
    "コンテストごとに独自の「ペナルティ」が定まっています．公式コンテストでは基本的に5分間です．": "Each contest has its own penalty time setting. For official contests, it is generally 5 minutes.",
    "コンテスト中に正答した各問題について，正答までに出した誤答の数だけペナルティが加算されます．": "For each problem solved correctly, a penalty is added for each incorrect attempt made before the correct answer.",
    "最終的に正答できなかった問題については，ペナルティは加算されません．": "No penalties are added for problems that are ultimately left unsolved.",
    "順位は総合得点で決定します．": "Ranking is determined based on total score.",
    "同点の場合，最後の正答までの経過時間にペナルティを加えたものが短いsolverが上位となります．": "In case of a tie, the solver with the shorter time to the last correct submission (including penalties) ranks higher.",
    "順位表の表示について": "About the Scoreboard Display",
    "コンテスト中の順位表は，ペナルティを考慮した正確な順位を表示します．また誤答数も表示されます．": "During contests, the scoreboard displays accurate rankings that include penalties. The number of incorrect attempts is also shown.",
    "ratingについて": "About Rating",
    "ratingは一つの非負整数値で表現され，よりratingの大きいsolverがより高い実力を有するとみなされます．": "Rating is represented as a non-negative integer; a higher rating indicates greater skill.",
    "ratingは過去に参加したコンテストの成績のみによって決定されます．": "Rating is determined solely by your performance in past contests.",
    "コンテストの種別ごとに，参加時のratingによって変動の有無が決まっています．その範囲外である場合もコンテストへの参加は可能ですがratingの変動は発生いたしません．": "Depending on the contest type, rating changes may or may not occur based on your rating at the time of participation. You can still join contests even if you're outside the target range, but your rating will not change.",
    "現在のところ，「OMCXXX」の形式で命名される公式のコンテストは，以下の3種類に分類されております．": "Currently, official contests named in the 'OMCXXX' format are categorized into the following three types:",
    "OMCB：参加時のratingが1199以下のsolverが変動の対象，基本的に6問，60分前後": "OMCB: Targeted for solvers with a rating of 1199 or lower at the time of participation. Typically includes 6 problems and lasts around 60 minutes.",
    "無印：参加時のratingが1999以下のsolverが変動の対象，基本的に6問，100分前後": "Unlabeled: Targeted for solvers with a rating of 1999 or lower. Typically includes 6 problems and lasts around 100 minutes.",
    "OMCE：参加時のratingが800以上のsolverが変動の対象，基本的に6問，150分前後": "OMCE: Targeted for solvers with a rating of 800 or higher. Typically includes 6 problems and lasts around 150 minutes.",
    "これらのいずれにも分類されないものは非公式のコンテストであり，ratingの変動は発生いたしません．": "Contests that do not fall under any of these categories are unofficial, and do not affect rating.",
    "参加登録について": "About Contest Registration",
    "コンテストの参加には参加登録が必要です．参加登録を行わない限り，問題を閲覧することができません．": "You must register to participate in a contest. Without registration, you will not be able to view the problems.",
    "ratingの変動の対象でないsolverについては，「参加登録」のボタンを押すことで直ちに登録が完了いたします．": "If you are not subject to rating change, simply clicking the 'Register' button will complete your registration immediately.",
    "ratingの変動の対象であるsolverについては，以下の手順をお踏みください．": "If your rating is subject to change, please follow the steps below.",
    "「参加登録」のボタンを押すと，次に「ratedとして参加」「unratedとして参加」の二つの選択肢が現れます．これらいずれかを選択しない限り，参加登録は完了せず，コンテストには参加できませんのでご注意ください．": "After clicking the 'Register' button, you will be prompted to choose between 'Participate as Rated' and 'Participate as Unrated'. Please note that unless you make a selection, registration will not be completed and you will not be able to join the contest.",
    "「unratedとして参加」を選択した場合，コンテストへの参加は可能ですが，ratingの変動は発生いたしません．": "If you choose 'Participate as Unrated', you may still participate in the contest, but your rating will not change.",
    "コンテストが始まるまでは，参加登録を取り消すことで「ratedとして参加」「unratedとして参加」を切り替えることが可能です．": "Before the contest begins, you may cancel your registration to switch between 'Participate as Rated' and 'Participate as Unrated'.",
    "「ratedとして参加」「unratedとして参加」はコンテスト開始から5分後まで選択が可能です．それまでに選択を行わなかった場合，自動的に「unratedとして参加」となります．": "You may choose between 'Participate as Rated' and 'Participate as Unrated' until 5 minutes after the contest starts. If no choice is made by then, you will automatically be registered as 'Unrated'.",
    "質問について": "About Questions",
    "「質問」ページから，不明瞭な点について運営に質問を投げかけることが可能です．": "You can submit questions about unclear points from the 'Questions' page.",
    "例えば，以下のようなケースが考えられます．": "For example, the following cases may apply:",
    "問題文や解答に誤りが含まれている．": "There is an error in the problem statement or solution.",
    "問題文の表現に不明瞭な点がある．": "There is an unclear expression in the problem statement.",
    "問題文中に知らない単語や記法が含まれている．": "There are unknown terms or notations in the problem statement.",
    "HPがおかしな挙動を示している．": "The website is behaving abnormally.",
    "基本的に質問の内容によらず一定時間で返答を行っております．ただし，協議のため長時間を要することがございます．": "In general, we respond to questions within a fixed timeframe regardless of content. However, some may require extended time due to internal discussion.",
    "すべての質問にお答えするとは限りません．例えば，解答や解法を尋ねるものには一切お答えできません．": "We may not respond to all questions. For example, we cannot answer questions that ask for the solution or method.",
    "こちら": "This",
    "に掲載されている用語・記法，および出題範囲で一般的に学習する用語・記法に関する質問にはお答えいたしません．": "glossary of terms and notations listed here, as well as those generally learned within the contest scope, are not subject to questions.",
    "重要度の高い質問は全体公開されることがございます．あらかじめご了承ください．": "Questions deemed important may be made public to all participants. Please be aware of this in advance.",
    "SNSなどへ疑問提起を行うことはお控えください．以下の「SNSなどへの言及について」もご参照ください．": "Please refrain from raising questions on social media. See also the section below titled 'About Mentions on SNS, etc.'",
    "ツールの禁止について": "About Tool Restrictions",
    "高度な計算機，描画ソフト，プログラミング，生成AIなどのツールの使用は，コンテスト中は禁止されております．": "Use of advanced calculators, drawing software, programming tools, and generative AI is prohibited during the contest.",
    "ただし，以下のものは許可されます．": "However, the following are allowed:",
    "コンテストページ内の電卓": "The calculator embedded in the contest page",
    "の用語表": "glossary",
    "の素数表": "prime number table",
    "翻訳ツール": "translation tools",
    "定規やコンパスといったアナログなツールは使用が認められます．": "Analog tools such as rulers and compasses are permitted.",
    "コンテスト中のインターネットの検索，およびインターネット上の資料の参照は禁止されております．ただし，当サイト内の一切の情報についてはこの限りではありません．": "Searching the internet or referencing online materials is prohibited during the contest. However, all information within this site is exempt from this restriction.",
    "問題文中で特定のインターネット上の資料について個別に参照が認められることがあります．": "Some problems may explicitly permit reference to specific online resources.",
    "紙媒体や電子書籍など，インターネットから独立した資料の参照や検索は許可されます．例えば，以下の行為は認められます．": "You may refer to or search through offline resources such as printed books or e-books. For example, the following actions are allowed:",
    "コンテスト前に自ら参考資料を作成し，それを利用する．": "Preparing your own reference materials before the contest and using them during the contest.",
    "インターネット上の資料を印刷ないし手元に保存し，それを利用する．": "Printing or saving online materials beforehand and using them during the contest.",
    "コンテスト中はSNSの参照・検索も禁止されております．発信についても，以下の点にご留意ください．": "Browsing or searching social media during the contest is also prohibited. Please also be mindful of the following points regarding posting.",
    "SNSなどへの言及について": "About Mentions on SNS, etc.",
    "すべての人に公開されている情報を投稿することは問題ありません．例えば，": "It is permissible to post information that is publicly available to all participants. For example:",
    "ある時点での正解者の人数・提出者の人数": "Number of correct submissions or total submissions at a given time",
    "ある問題の最初の正答者": "The first person to correctly solve a problem",
    "あるsolverが何点を獲得したか": "The score obtained by a solver",
    "ある問題で何回誤答したか": "The number of incorrect submissions on a problem",
    "などは，コンテスト中に順位表から得られるため，すべての人に公開されている情報であるからです．": "These are publicly available through the scoreboard during the contest and thus may be shared.",
    "自身の行動について，順位表から得られない情報への言及は禁止されております．": "Mentioning any behavior of your own that is not shown on the scoreboard is prohibited.",
    "問題の内容に踏み込んだ具体的な言及も禁止されております．例えば，": "Direct references to the content of problems are also prohibited. For example:",
    "問題の分野に関する言及": "Mentioning the subject area of a problem",
    "具体的な解法に関する言及（「これは〇〇の定理でやるだけ」など）": "Mentioning a specific solution method (e.g., 'You just use XXX's theorem')",
    "難易度感に対する言及（「これは個人的には300点だと思う」など）": "Commenting on perceived difficulty (e.g., 'I feel this is worth 300 points')",
    "以上の言及は，すべてコンテスト終了と同時に解禁されます．": "All of the above references are allowed only after the contest has ended.",
    "自作問題の提出について": "About Submitting Original Problems",
    "右上のメニュー内「問題作成」より，自作問題の提出および管理が可能です．": "You can submit and manage your original problems via the 'Create Problems' option in the top-right menu.",
    "詳細は「": "For details, please refer to",
    "Writer/Testerについて": "About Writers & Testers",
    "」をご確認ください．": "."
}